PinkFluffyUnic0rn/stm32flight/main.c
	// update battery voltage
	writelog(LOG_BAT, dsp_getlpf(Lpf + LPF_BAT));

	// toggle arming indication led
	HAL_GPIO_WritePin(armgpio, armpin,
		(En > 0.5) ? GPIO_PIN_SET : GPIO_PIN_RESET);

	// apply accelerometer offsets
	Imudata.afx += (Imudata.ft - 25.0) * St.adj.acctsc.x;
	Imudata.afy += (Imudata.ft - 25.0) * St.adj.acctsc.y;
	Imudata.afz += (Imudata.ft - 25.0) * St.adj.acctsc.z;
	Imudata.afx -= St.adj.acc0.x;
	Imudata.afy -= St.adj.acc0.y;
	Imudata.afz -= St.adj.acc0.z;

	// apply gyroscope offsets
	Imudata.gfx -= St.adj.gyro0.x;
	Imudata.gfy -= St.adj.gyro0.y;
	Imudata.gfz -= St.adj.gyro0.z;

	// write accelerometer and gyroscope values into log
	writelog(LOG_ACC_X, Imudata.afx);
	writelog(LOG_ACC_Y, Imudata.afy);
	writelog(LOG_ACC_Z, Imudata.afz);
	writelog(LOG_GYRO_X, Imudata.gfx);
	writelog(LOG_GYRO_Y, Imudata.gfy);
	writelog(LOG_GYRO_Z, Imudata.gfz);

	// update accelerometer temperature
	dsp_updatelpf(Lpf + LPF_IMUTEMP, Imudata.ft);

	// apply accelerometer offsets
	ax = dsp_updatelpf(Lpf + LPF_ACCX, Imudata.afx);
	ay = dsp_updatelpf(Lpf + LPF_ACCY, Imudata.afy);
	az = dsp_updatelpf(Lpf + LPF_ACCZ, Imudata.afz);

	// update vertical acceleration low-pass filter
	dsp_updatelpf(Lpf + LPF_THR, Imudata.afz);

	// convert gyroscope values into radians
	gx = deg2rad(dsp_updatelpf(Lpf + LPF_GYROX, Imudata.gfx));
	gy = deg2rad(dsp_updatelpf(Lpf + LPF_GYROY, Imudata.gfy));
	gz = deg2rad(dsp_updatelpf(Lpf + LPF_GYROZ, Imudata.gfz));

	// update complimenraty filter for roll axis and get next roll
	// value. First signal (value) is signal to be integrated: it's
	// the speed of the rotation around Y axis. Second signal is
	// signal to be low-pass filtered: it's the tilt value that is
	// calculated from acceleromer readings through some
	// trigonometry.
	roll = dsp_updatelpf(Lpf + LPF_ROLL,
		dsp_updatecompl(Cmpl + CMPL_ROLL, gy * dt,
			atan2f(-ax, az) - St.adj.att0.roll));

	// same as for roll but for different axes
	pitch = dsp_updatelpf(Lpf + LPF_PITCH,
		dsp_updatecompl(Cmpl + CMPL_PITCH, gx * dt,
			atan2f(ay, sqrt(ax * ax + az * az))) 
				- St.adj.att0.pitch);

	// update complimenraty filter for yaw axis and get next yaw
	// value. First signal is the speed of the rotation around Z
	// axis. Second signal is the heading value that is
	// calculated from magnetometer readings.
	yaw = dsp_updatelpf(Lpf + LPF_YAW,
		circf(dsp_updatecirccompl(Cmpl + CMPL_YAW, -gz * dt,
		qmc_heading(roll, -pitch,
			Qmcdata.fx, Qmcdata.fy, Qmcdata.fz)) 
			- St.adj.att0.yaw));

	// calculate gravity direction vector in IMU coordination system
	// using pitch and roll values;
	vx = -sin(roll);
	vy = sin(pitch) * cos(roll);
	vz = cos(pitch) * cos(roll);

	// update vertical acceleration using acceleration
	// vector to gravity vector projection
	va = (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz);

	dsp_updatelpf(Lpf + LPF_VAU, va);
	dsp_updatelpf(Lpf + LPF_VAPT1, va);
	dsp_updatelpf(Lpf + LPF_VAAVG, va);

	// write vertical acceleration into log	
	writelog(LOG_VACCEL, dsp_getlpf(Lpf + LPF_VAU));

	// calculate forward direction vector in IMU
	// coordination system using pitch and roll values;
	vx = 0;
	vy = cos(pitch);
	vz = -sin(pitch);

	// update forward acceleration using acceleration
	// vector to gravity vector projection
	dsp_updatelpf(Lpf + LPF_FA, (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz));

	// write forward acceleration into log	
	writelog(LOG_FACCEL, dsp_getlpf(Lpf + LPF_FA));

	// calculate sideward direction vector in IMU
	// coordination system using pitch and roll values;
	vx = cos(roll);
	vy = sin(pitch) * sin(roll);
	vz = sin(roll) * cos(pitch);

	// update sideward acceleration using acceleration
	// vector to gravity vector projection
	dsp_updatelpf(Lpf + LPF_SA, (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz));
	
	// write sideward acceleration into log	
	writelog(LOG_SACCEL, dsp_getlpf(Lpf + LPF_SA));

	if (Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)) {
		float heading, hc;

		// calculate weighted heading, giving more
		// weight to magnetometer+gyroscope calculated
		// weight when speed is small
		hc = Gnss.speed * St.adj.yawmix;

		hc = hc > 1.0 ? 1.0 : 0.0;

		heading = (1.0 - hc) * yaw + hc * Gnss.course;

		writelog(LOG_CUSTOM3, heading);

		// calculate speed through latitude from
		// forward and sideward accelerations and
		// GNSS speed using complimetary filter
		dsp_updatecompl(Cmpl + CMPL_SLAT,
			9.80665 * (
			- dsp_getlpf(Lpf + LPF_FA) * cosf(heading)
			+ dsp_getlpf(Lpf + LPF_SA) * sinf(heading))
			* dt, -Gnss.speed / 3.6 * cosf(heading));

		// calculate speed through longitude from
		// forward and sideward accelerations and
		// GNSS speed using complimetary filter
		dsp_updatecompl(Cmpl + CMPL_SLON,
			9.80665 * (
			- dsp_getlpf(Lpf + LPF_FA) * sinf(heading)
			- dsp_getlpf(Lpf + LPF_SA) * cosf(heading))
			* dt, -Gnss.speed / 3.6 * sinf(heading));

		// calculate latitude from speed and GNSS
		// latitude using complimentary filter
		dsp_updatecompl(Cmpl + CMPL_LAT,
			dsp_getcompl(Cmpl + CMPL_SLAT) * dt,
			dsp_getlpf(Lpf + LPF_LATM));

		// calculate longitude from speed and GNSS
		// latitude using complimentary filter
		dsp_updatecompl(Cmpl + CMPL_LON,
			dsp_getcompl(Cmpl + CMPL_SLON) * dt,
			dsp_getlpf(Lpf + LPF_LONM));

		// calculate horizontal speed from speed
		// values through longitude and latitude
		dsp_updatelpf(Lpf + LPF_SPEED,
			sqrtf(powf(dsp_getcompl(Cmpl + CMPL_SLAT), 2.0)
			+ powf(dsp_getcompl(Cmpl + CMPL_SLON), 2.0)));

		// write speed values through latitude and longitude,
		// horizontal speed, latitude and longitude into log
		writelog(LOG_SLAT, dsp_getcompl(Cmpl + CMPL_SLAT));
		writelog(LOG_SLON, dsp_getcompl(Cmpl + CMPL_SLON));
		writelog(LOG_SPEED, dsp_getlpf(Lpf + LPF_SPEED));
		writelog(LOG_LAT, dsp_getcompl(Cmpl + CMPL_LAT));
		writelog(LOG_LON, dsp_getcompl(Cmpl + CMPL_LON));
	}

	// get last barometric altitude
	alt = dsp_getlpf(Lpf + LPF_ALT);

