PinkFluffyUnic0rn/stm32flight/main.c
	// calculate altitude thrust compensation
	altcor = St.adj.althold.alttha * dsp_getlpf(Lpf + LPF_AVGTHRA)
		+ St.adj.althold.altthb;
	altcor = (altcor < 0.0) ? 0.0 : altcor;

	// compensate thrust for altitude
	alt -= altcor;	

	// if GNSS is locked, use speed to compensate dynamic pressure
	if (Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)) {
		float sp;

		sp = dsp_getlpf(Lpf + LPF_SPEED);

		altcor = St.adj.althold.altthc * sp * sp;
		alt -= altcor;
	}

	// calculate climb rate from vertical acceleration and
	// barometric altitude defference using complimentary filter
	dsp_updatecompl(Cmpl + CMPL_CLIMBRATE,
		9.80665 * (dsp_getlpf(Lpf + LPF_VAU) + Goffset - 1.0) * dt,
			(dsp_getcompl(Cmpl + CMPL_ALT) - prevalt) / dt);
	
	// calculate presice altitiude from climb rate and
	// barometric altitude using complimentary filter
	dsp_updatecompl(Cmpl + CMPL_ALT,
		dsp_getcompl(Cmpl + CMPL_CLIMBRATE) * dt, alt);

	// store calculated alt for next calculation
	prevalt = dsp_getcompl(Cmpl + CMPL_ALT);

	// write climbrate and altitude values into log
	writelog(LOG_CLIMBRATE, dsp_getcompl(Cmpl + CMPL_CLIMBRATE));
	writelog(LOG_ALT, dsp_getcompl(Cmpl + CMPL_ALT));

	// get tilt compensation coefficient
	tiltcoef = cosf(-pitch) * cosf(-roll);

	// get pitch corrected value of the hover throttle
	ht = St.adj.althold.hoverthrottle / tiltcoef;

	// if vertical acceleration is negative, most likely
	// quadcopter is upside down, perform emergency disarm
	if (dsp_getlpf(Lpf + LPF_THR) < -0.5) {
		Emergencydisarm = 1;
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);
		En = 0.0;
	}

	// write roll, pitch and yaw values into log
	writelog(LOG_ROLL, roll);
	writelog(LOG_PITCH, pitch);
	writelog(LOG_YAW, yaw);

	if (Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)
			&& Gnssmode == GNSSMODE_POS) {
		rollcor = dsp_pidbl(Pid + PID_LON, Rolltarget,
			dsp_getcompl(Cmpl + CMPL_SLAT));
		pitchcor = dsp_pidbl(Pid + PID_LAT, Pitchtarget,
			dsp_getcompl(Cmpl + CMPL_LAT));

/*
		float loncor, latcor;
		float heading, hc;

		float rt, pt;


		rt = -Rolltarget * cosf(heading)
			+ Pitchtarget * sinf(heading);
			
		pt = -Rolltarget * sinf(heading)
			- Pitchtarget * cosf(heading);

		// calculate weighted heading, giving more
		// weight to magnetometer+gyroscope calculated
		// weight when speed is small
		hc = Gnss.speed * St.adj.yawmix;

		hc = hc > 1.0 ? 1.0 : 0.0;

		heading = (1.0 - hc) * yaw + hc * Gnss.course;


		loncor = dsp_pidbl(Pid + PID_SLON, rt,
			dsp_getcompl(Cmpl + CMPL_SLON));
		latcor = dsp_pidbl(Pid + PID_SLAT, pt,
			dsp_getcompl(Cmpl + CMPL_SLAT));

		rollcor = -cosf(heading) * loncor + sinf(heading) * latcor;
		pitchcor = cosf(heading) * latcor + sinf(heading) * loncor;

		rollcor = trimf(rollcor,
			-M_PI * St.ctrl.rollmax * 0.25,
			M_PI * St.ctrl.rollmax * 0.25);

		pitchcor = trimf(pitchcor,
			-M_PI * St.ctrl.pitchmax * 0.25,
			M_PI * St.ctrl.pitchmax * 0.25);
*/

		rollcor = -dsp_pidbl(Pid + PID_SLON, Rolltarget,
			dsp_getcompl(Cmpl + CMPL_SLON));
		pitchcor = dsp_pidbl(Pid + PID_SLAT, Pitchtarget,
			dsp_getcompl(Cmpl + CMPL_SLAT));

		rollcor = trimf(rollcor,
			-M_PI * St.ctrl.rollmax * 0.25,
			M_PI * St.ctrl.rollmax * 0.25);

		pitchcor = trimf(pitchcor,
			-M_PI * St.ctrl.pitchmax * 0.25,
			M_PI * St.ctrl.pitchmax * 0.25);

		rollcor = dsp_pidbl(Pid + PID_ROLLP, rollcor, roll);
		pitchcor = dsp_pidbl(Pid + PID_PITCHP, pitchcor, pitch);

		rollcor = dsp_pidbl(Pid + PID_ROLLS, rollcor, gy);
		pitchcor = dsp_pidbl(Pid + PID_PITCHS, pitchcor, gx);
	}
	else if (Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)
			&& Gnssmode == GNSSMODE_SPEED) {
/*
		float loncor, latcor;
		float heading, hc;
		float rt, pt;

		rt = -Rolltarget * cosf(heading)
			+ Pitchtarget * sinf(heading);
			
		pt = -Rolltarget * sinf(heading)
			- Pitchtarget * cosf(heading);

		// calculate weighted heading, giving more
		// weight to magnetometer+gyroscope calculated
		// weight when speed is small
		hc = Gnss.speed * St.adj.yawmix;

		hc = hc > 1.0 ? 1.0 : 0.0;

		heading = (1.0 - hc) * yaw + hc * Gnss.course;

		loncor = dsp_pidbl(Pid + PID_SLON, rt,
			dsp_getcompl(Cmpl + CMPL_SLON));
		latcor = dsp_pidbl(Pid + PID_SLAT, pt,
			dsp_getcompl(Cmpl + CMPL_SLAT));

		rollcor = -cosf(heading) * loncor + sinf(heading) * latcor;
		pitchcor = cosf(heading) * latcor + sinf(heading) * loncor;

		rollcor = trimf(rollcor,
			-M_PI * St.ctrl.rollmax * 0.25,
			M_PI * St.ctrl.rollmax * 0.25);

		pitchcor = trimf(pitchcor,
			-M_PI * St.ctrl.pitchmax * 0.25,
			M_PI * St.ctrl.pitchmax * 0.25);
*/

		rollcor = -dsp_pidbl(Pid + PID_SLON, Rolltarget,
			dsp_getcompl(Cmpl + CMPL_SLON));
		pitchcor = dsp_pidbl(Pid + PID_SLAT, Pitchtarget,
			dsp_getcompl(Cmpl + CMPL_SLAT));

		rollcor = trimf(rollcor,
			-M_PI * St.ctrl.rollmax * 0.25,
			M_PI * St.ctrl.rollmax * 0.25);

		pitchcor = trimf(pitchcor,
			-M_PI * St.ctrl.pitchmax * 0.25,
			M_PI * St.ctrl.pitchmax * 0.25);

		rollcor = dsp_pidbl(Pid + PID_ROLLP, rollcor, roll);
		pitchcor = dsp_pidbl(Pid + PID_PITCHP, pitchcor, pitch);

		rollcor = dsp_pidbl(Pid + PID_ROLLS, rollcor, gy);
		pitchcor = dsp_pidbl(Pid + PID_PITCHS, pitchcor, gx);
	}
	else if (Speedpid) {
		// if in single PID loop mode for tilt
		// (called accro mode), use only rotation speed values
		// from the gyroscope. Update speed PID controllers for
		// roll and pitch and get next correction values.
		rollcor = dsp_pidbl(Pid + PID_ROLLS, Rolltarget, gy);
		pitchcor = dsp_pidbl(Pid + PID_PITCHS, Pitchtarget, gx);
	}
	else {
		// if in double loop mode for tilt (most commonly used
		// mode), first update roll and pitch POSITION PID
		// controllers using currect roll and values and targets
		// got from ERLS and get next correction values.
		rollcor = dsp_pidbl(Pid + PID_ROLLP, Rolltarget, roll);
		pitchcor = dsp_pidbl(Pid + PID_PITCHP, Pitchtarget, pitch);

		// then use this values to update roll and pitch speed
		// PID controllers and get next SPEED correction values.
		rollcor = dsp_pidbl(Pid + PID_ROLLS, rollcor, gy);
		pitchcor = dsp_pidbl(Pid + PID_PITCHS, pitchcor, gx);
	}
			
	if (Yawspeedpid) {
		// if single PID loop mode for yaw is used just use
		// rotation speed values around axis Z to upadte yaw PID
		// controller and get next yaw correciton value
		yawcor = dsp_pidbl(Pid + PID_YAWS, Yawtarget, -gz);
	}
	else {
		// if in double loop mode for yaw, first use yaw value
		// calcualted using magnetometer and yaw target got from
		// ELRS remote to update yaw POSITION PID controller and
		// get it's next correciton value.
		yawcor = dsp_pidbl(Pid + PID_YAWP, Yawtarget, yaw);

		// then use this value to update yaw speed PID
		// controller and get next yaw SPEED correction value
		yawcor = dsp_pidbl(Pid + PID_YAWS, yawcor, -gz);
	}

