PinkFluffyUnic0rn/stm32flight/main.c
		return 0;
	}

	// get time passed from last ERLS packet
	dt = ms / (float) TICKSPERSEC;

	// SETSLOT channel is used to select settings slot, it is
	// a 6 position switch on remote used for testing
	if (cd->chf[ERLS_CH_SETSLOT] < -0.8)		slot = 0;
	else if (cd->chf[ERLS_CH_SETSLOT] < -0.4)	slot = 1;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0)		slot = 2;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0.4)	slot = 3;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0.8)	slot = 4;
	else						slot = 5;

	// slot changed differ from current, wait some time to
	// ensure that it's not a some error, if enough time passed,
	// load settings from choosen slot
	if (slot != Curslot) {
		slottimeout -= dt;

		if (slottimeout <= 0.0) {
			readsettings(slot);
			setstabilize(0);

			Curslot = slot;
		}
	} else
		slottimeout = ELRS_PUSHTIMEOUT;

	// AUTOPILOT channel is used to turn on/off autopilot
	// if it is greater than 0, autopilot is on, otherwise
	// it is turned off
	Autopilot = 0;
/*
	if (cd->chf[ERLS_CH_AUTOPILOT] > 0.0) {
		if (Autopilot == 0)
			Curpoint = 0;

		Autopilot = 1;
	}
	else
		Autopilot = 0;
*/		

	// set magnetometer stabilization mode, if YAWMODE channel has
	// value more than 0, set gyroscope only stabilization mode 
	// otherwise
	if (Autopilot) {
	//	Yawtarget = 0.0;
		Yawspeedpid = 0;
	}
	else if (cd->chf[ERLS_CH_YAWMODE] > 0.0
			&& Dev[DEV_MAG].status == DEVSTATUS_INIT) {
		Yawspeedpid = 0;

		// in magnetometer stabilization mode absolute yaw
		// value is stabilized, so target should be integrated
		Yawtarget = circf(Yawtarget
			+ cd->chf[ERLS_CH_YAW] * dt * M_PI
				* St.ctrl.yawrate);
	}
	else {
		Yawspeedpid = 1;
		Yawtarget = cd->chf[ERLS_CH_YAW]
			* M_PI * St.ctrl.yawrate;
	}

	// set altitude hold mode, if THRMODE channel has value more
	// than 25, set climbrate stabilization mode if THRMODE channel
	// has value between -25 and 25, set vertical acceleration mode
	// if THRMODE channel value is less than -25
	if (Autopilot) {
		Altmode = ALTMODE_POS;
	}
	else if (cd->chf[ERLS_CH_THRMODE] > 0.25
			&& Dev[DEV_BARO].status == DEVSTATUS_INIT) {
		Altmode = ALTMODE_POS;
		Thrust = (cd->chf[ERLS_CH_THRUST] + 1.0)
			/ 2.0 * St.ctrl.altmax;
	}
	else if (cd->chf[ERLS_CH_THRMODE] > -0.25
			&& Dev[DEV_BARO].status == DEVSTATUS_INIT) {
		Altmode = ALTMODE_SPEED;
		Thrust = cd->chf[ERLS_CH_THRUST] * St.ctrl.climbratemax;
	}
	else {
		Altmode = ALTMODE_ACCEL;

		// Set throttle mode usging HOVER channel,
		// if it is less that 0.0, use throttle setpoint
		// range starting slightly less than 0,
		// otherwise use throttle setpoint range with
		// 0 value in middle
		if (cd->chf[ERLS_CH_HOVER] < 0.0) {
			Hovermode = 0;
			Thrust = (cd->chf[ERLS_CH_THRUST] + 0.5)
				/ 1.5 * St.ctrl.accelmax;
		}
		else {
			Hovermode = 1;
			Thrust = (cd->chf[ERLS_CH_THRUST])
				/ 2.0 * St.ctrl.accelmax;
		}
	}

	// if ALTCALIB channel is active (it's no-fix button on remote
	// used for testing), set reference altitude from current
	// altitude
	if (cd->chf[ERLS_CH_ALTCALIB] > 0.0) {
		Alt0 = dsp_getcompl(Cmpl + CMPL_ALT);
		Lat0 = Gnss.declat;
		Lon0 = Gnss.declon;
		Goffset = 1.0 - dsp_getlpf(Lpf + LPF_VAAVG);
	}

	// set acceleromter stabilization mode, if ATTMODE channel has
	// value more than 25, set gyroscope only stabilization mode, if
	// ATTMODE channel has value between -25 and 25, disarm if
	// channel ATTMODE value is less than -25
/*
	if (autopilot) {
		en = 1;
		speedpid = 0;

		Rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * St.rollmax);
	}
	else 
	*/	
	if (cd->chf[ERLS_CH_ATTMODE] > 0.25) {
		int changed;

		changed = (En == 0 || Speedpid == 1);

		En = 1;
		Speedpid = 0;
		
		if (changed)	
			setstabilize(0);

		// set pitch/roll targets based on
		// channels 1-2 values (it's a joystick on most remotes)
		Rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * St.ctrl.rollmax);
		Pitchtarget = -cd->chf[ERLS_CH_PITCH]
			* (M_PI * St.ctrl.pitchmax);
	}
	else if (cd->chf[ERLS_CH_ATTMODE] < -0.25) {
		En = 0;
		Speedpid = 0;
	}
	else {
		int changed;

		changed = (En == 0 || Speedpid == 0);

		En = 1;
		Speedpid = 1;
		
		if (changed)	
			setstabilize(0);

		// set pitch/roll targets based on
		// channels 1-2 values (it's a joystick on most remotes)
		Rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * St.ctrl.rollrate);
		Pitchtarget = -cd->chf[ERLS_CH_PITCH]
			* (M_PI * St.ctrl.pitchrate);
	}

	if (cd->chf[ERLS_CH_GNSSMODE] > 0.25
			&& Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)) {
		Gnssmode = GNSSMODE_POS;

		Rolltarget += dt * cd->chf[ERLS_CH_ROLL];
		Pitchtarget += dt * cd->chf[ERLS_CH_PITCH];
	}
	else if (cd->chf[ERLS_CH_GNSSMODE] > -0.25
			&& Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)) {
		Gnssmode = GNSSMODE_SPEED;

		Rolltarget = -cd->chf[ERLS_CH_ROLL] * 4.0;
		Pitchtarget = -cd->chf[ERLS_CH_PITCH] * 4.0;
	}
	else {
		Gnssmode = GNSSMODE_NONE;
	}

	// disable thrust when motors should be
	// disabled, for additional safety
	if (En < 0.5)
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);

	return 0;
}

/**
* @brief Store data got from NMEA message.
* @param nd data got from GNSS device through NMEA protocol
* @return always 0
*/
int m10msg(struct m10_data *nd)
{
	// got only altitude and signal quality data from GGA messages.
	if (nd->type == M10_TYPE_GGA) {
		Gnss.altitude = nd->gga.alt;
		Gnss.quality = nd->gga.quality;
		Gnss.satellites = nd->gga.sats;

		// write GGA values into log
		writelog(LOG_GNSS_ALT, Gnss.altitude);
		writelog(LOG_GNSS_QUAL, Gnss.quality);
		writelog(LOG_GNSS_SATS, Gnss.satellites);

		return 0;
	}

	// other needed data is got from RMC
	// messages. Discard all other messages.
	if (nd->type != M10_TYPE_RMC)
		return 0;

	Gnss.time = nd->rmc.time;
	memcpy(Gnss.date, nd->rmc.date, 10);

	Gnss.latmin = nd->rmc.latmin;
	Gnss.lat = nd->rmc.lat;
	Gnss.latdir = (tolower(nd->rmc.latdir) == 'n')
		? LATDIR_N : LATDIR_S;
	Gnss.declat = Gnss.lat + Gnss.latmin / 60.0;

	Gnss.lonmin = nd->gga.lonmin;
	Gnss.lon = nd->rmc.lon;
	Gnss.londir = (tolower(nd->rmc.londir) == 'e')
		? LONDIR_E : LONDIR_W;
	Gnss.declon = Gnss.lon + Gnss.lonmin / 60.0;

